CO3 - BPMNs - CODE/DPG/Activacion_Canales_Externos/XML/CreateExternalAsset_Request_Padre.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cus="http://siebel.com/CustomUI" xmlns:swi="http://www.siebel.com/xml/SWIAssetManagementIO">
   <soapenv:Header/>
   <soapenv:Body>
      <cus:CreateExternalAsset_Input>
         <swi:ListOfSWIAssetManagementIO>
            <!--Zero or more repetitions:-->
            <swi:SwiAssetMgmt-Asset>              
               <swi:AccountName>WILLY ROLANDO PEREZ SILLO</swi:AccountName>
               <swi:AssetNumber>AUTOGEN</swi:AssetNumber>
               <swi:BillingAccountId>1-61L3A5</swi:BillingAccountId>
               <swi:BillingProfileId>1-61L3A5</swi:BillingProfileId>
               <swi:CfgStateCode>User Requested Item</swi:CfgStateCode>
               <swi:CfgType>eConfigurator</swi:CfgType>
               <swi:Name>DEPOSITOS</swi:Name>
               <swi:OperatingStatus>ACTIVO</swi:OperatingStatus>
               <swi:OwnerAccountId>1-61KXTG</swi:OwnerAccountId>            
               <swi:ParentAssetId></swi:ParentAssetId> 
               <swi:RootAssetId></swi:RootAssetId>              
               <swi:ProductId>1-68FIGC</swi:ProductId>               
               <swi:Quantity>1</swi:Quantity>
               <swi:SerialNumber/>
               <swi:ServiceAccountId>1-62ENYX</swi:ServiceAccountId>
               <swi:Status>ACTIVO</swi:Status>
               <swi:ProductName>DEPOSITOS</swi:ProductName>
               <swi:IntegrationId>AUTOGEN</swi:IntegrationId>
               <swi:TGServiceActivationPoint>SSG</swi:TGServiceActivationPoint>
               <swi:TGTIGOSalesRepresentative>5897456</swi:TGTIGOSalesRepresentative>
            </swi:SwiAssetMgmt-Asset>
         </swi:ListOfSWIAssetManagementIO>
      </cus:CreateExternalAsset_Input>
   </soapenv:Body>
</soapenv:Envelope>
